package by.it.eivanova.jd01_15;

public class TaskC {


    //Нужно реализовать на java приложение - аналог командной строки Windows. Приложение должно использовать класс File и поддерживать две команды консоли:
    // команду cd - смена каталога (посмотрите пример: Win+R → cmd → cd \ → dir ). В тестах проверяются всего
    //две команды cd .. и cd имя_папки_в_текущем_каталоге
    // команду dir - вывод каталога, формат вывода - аналогичный формату в Windows.
    // команда end – завершение работы.
    // Стартовым каталогом при запуске приложения должна быть папка by.it.ваша_фамилия.jd01_15

    public static void main(String[] args) {

    }

}
